Revit 2022 API
SetupEnergySimulationDialog.Dispose Method
Releases all resources used by the SetupEnergySimulationDialog
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
SetupEnergySimulationDialog Class
Autodesk.Revit.UI Namespace